num = '123е'
num2 = '91.4'
# num3 = 524.345 ** 435345345311145345 Не возможно создать такое число
num4 = '7.1 + 4'
# num5 = '4' - 2 Нельзя вычесть из строки число
num6 =  '4 - 2'
num7 = '42'
num8 = -12.12

# print(int(num)) нельзя преобразовать выражение в число
# print(int(num2)) за одну операцию инт не получислся перевесли строковое число с точной в инт, а только в флоат
# print(int(num3))
# print(int(num4)) нельзя преобразовать выражение в число
# print(int(num5))
# print(int(num6)) нельзя преобразовать выражение в число
print(int(num7))
print(int(num8))